/*王浩 信07 2152041*/
#include <iostream>
using namespace std;

/***************************************************************************
  函数名称：
  功    能：输出位数、正序、逆序
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
***************************************************************************/
void output(int k)
{
	if (k / 10000 % 10 == 0 && k / 1000 % 10 == 0 && k / 100 % 10 == 0 && k / 10 % 10 == 0)
	{
		cout << "一位数\n";
		cout << "每位数字分别是 : \n";
		cout << k << endl;
		cout << "逆序输出的每位数字分别是 : \n";
		cout << k << endl;
	}
	else if (k / 10000 % 10 == 0 && k / 1000 % 10 == 0 && k / 100 % 10 == 0 && k / 10 % 10 != 0)
	{
		cout << "两位数\n";
		cout << "每位数字分别是 : \n";
		cout << k / 10 % 10 << " " << k % 10 << endl;
		cout << "逆序输出的每位数字分别是 : \n";
		cout << k % 10 << " " << k / 10 % 10 << endl;
	}
	else if (k / 10000 % 10 == 0 && k / 1000 % 10 == 0 && k / 100 % 10 != 0)
	{
		cout << "三位数\n";
		cout << "每位数字分别是 : \n";
		cout << k / 100 % 10 << " " << k / 10 % 10 << " " << k % 10 << endl;
		cout << "逆序输出的每位数字分别是 : \n";
		cout << k % 10 << " " << k / 10 % 10 << " " << k / 100 % 10 << endl;
	}
	else if (k / 10000 % 10 == 0 && k / 1000 % 10 != 0)
	{
		cout << "四位数\n";
		cout << "每位数字分别是 : \n";
		cout << k / 1000 % 10 << " " << k / 100 % 10 << " " << k / 10 % 10 << " " << k % 10 << endl;
		cout << "逆序输出的每位数字分别是 : \n";
		cout << k % 10 << " " << k / 10 % 10 << " " << k / 100 % 10 << " " << k / 1000 % 10 << endl;
	}
	else
	{
		cout << "五位数\n";
		cout << "每位数字分别是 : \n";
		cout << k / 10000 % 10 << " " << k / 1000 % 10 << " " << k / 100 % 10 << " " << k / 10 % 10 << " " << k % 10 << endl;
		cout << "逆序输出的每位数字分别是 : \n";
		cout << k % 10 << " " << k / 10 % 10 << " " << k / 100 % 10 << " " << k / 1000 % 10 << " " << k / 10000 % 10 << endl;
	}
}

/***************************************************************************
  函数名称：
  功    能：重复输入，直到取得[0..99999]之间的整数后返回
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
***************************************************************************/
int input(void)
{
	int x;
	while (1) {
		cout << "请输入一个[0..99999]间的整数\n";
		cin >> x;
		if (cin.fail())
		{
			cin.clear();
			cin.ignore(65536, '\n');
			continue;
		}
		if (x >= 0 && x <= 99999)
			break;
	}
	return x;
}


/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int k;

	k = input();
	output(k);

	return 0;
}
