/* 2152041 王浩 信07 */
#include <iostream>
using namespace std;


/***************************************************************************
  函数名称：
  功    能：输出大写的0~9
  输入参数：
  返 回 值：
  说    明：除本函数外，不允许任何函数中输出“零”-“玖”!!!!!!
***************************************************************************/
void daxie(int num, int flag_of_zero)
{
	/* 不允许对本函数做任何修改 */
	switch (num) {
		case 0:
			if (flag_of_zero)	//此标记什么意思请自行思考
				cout << "零";
			break;
		case 1:
			cout << "壹";
			break;
		case 2:
			cout << "贰";
			break;
		case 3:
			cout << "叁";
			break;
		case 4:
			cout << "肆";
			break;
		case 5:
			cout << "伍";
			break;
		case 6:
			cout << "陆";
			break;
		case 7:
			cout << "柒";
			break;
		case 8:
			cout << "捌";
			break;
		case 9:
			cout << "玖";
			break;
		default:
			cout << "error";
			break;
	}
}

/* 可根据需要自定义其它函数(也可以不定义) */

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int main()
{
	double a, b;
	int i, c;
	cout << "请输入[0-100亿)之间的数字:\n";
	cin >> a;
	i = int(a / 10);
	b = a / 10 - i + 0.0001;
	c = int((i - int(i / 10000000) * 10000000) / 1000);//万位上的四位数字
	cout << "大写结果是:\n";
	daxie(i / 100000000 % 10, 0);
	if (i / 100000000 % 10 != 0)
		cout << "拾";
	if (i / 100000000 % 10 != 0 && i / 10000000 % 10 == 0)
		cout << "亿";
	daxie(i / 10000000 % 10, (i - int(i / 10000000) * 10000000) == 0 && int(10 * b) % 10 == 0 ? 0 : (i / 1000000 % 10 == 0 ? i / 100000000 % 10 : 0));
	if (i / 100000000 % 10 != 0 && i / 10000000 % 10 != 0)
		cout << "亿";
	if (i / 100000000 % 10 == 0 && i / 10000000 % 10 != 0)
		cout << "亿";
	if (i / 100000000 % 10 != 0 && i / 10000000 % 10 == 0)
		cout << "";
	daxie(i / 1000000 % 10, ((i - int(i / 1000000) * 1000000) == 0 && int(10 * b) % 10 == 0) ? 0 : ((c==0&& i / 100 % 10 != 0) ?0:i / 10000000 % 10));
	if (i / 1000000 % 10 != 0)
		cout << "仟";
	if (i / 100000 % 10 == 0 && i / 10000 % 10 == 0 && i / 1000 % 10 == 0 && i / 1000000 % 10 != 0)
		cout << "万";
	daxie(i / 100000 % 10, (i - int(i / 100000) * 100000) == 0 && int(10 * b) % 10 == 0 ? 0 : (c - int(c / 1000) * 1000 == 0 ? 0 : i / 1000000 % 10));
	if (i / 100000 % 10 != 0)
		cout << "佰";
	if (i / 10000 % 10 == 0 && i / 1000 % 10 == 0 && i / 100000 % 10 != 0)
		cout << "万";
	daxie(i / 10000 % 10, (i - int(i / 10000) * 10000) == 0 && int(10 * b) % 10 == 0 ? 0 : (c - int(c / 100) * 100 == 0 ? 0 : i / 100000 % 10));
	if (i / 10000 % 10 != 0)
		cout << "拾";
	if (i / 1000 % 10 == 0 && i / 10000 % 10 != 0)
		cout << "万";
	daxie(i / 1000 % 10, (i - int(i / 1000) * 1000) == 0 && int(10 * b) % 10 == 0 ? 0 : (c - int(c / 10) * 10 == 0 ? 0 : i / 10000 % 10));
	if (i / 1000 % 10 != 0)
		cout << "万";
	daxie(i / 100 % 10, (i - int(i / 100) * 100) == 0 && int(10 * b) % 10 == 0 ? 0 : (c == 0 ? 0 : 1));
	if (i / 100 % 10 != 0)
		cout << "仟";
	daxie(i / 10 % 10, (i - int(i / 10) * 10) == 0 && int(10 * b) % 10 == 0 ? 0 : i / 100 % 10);
	if (i / 10 % 10 != 0)
		cout << "佰";
	daxie(i % 10, (i - int(i)) == 0 && int(10 * b) % 10 == 0 ? 0 : i / 10 % 10);
	if (i % 10 != 0)
		cout << "拾";
	daxie(int(10 * b) % 10, a == 0 ? 1 : 0);
	if (i != 0 || int(10 * b) % 10 != 0 || a == 0)
		cout << "圆";
	if ((i != 0 || int(10 * b) % 10 != 0) && int(100 * b) % 10 == 0 && int(1000 * b) % 10 == 0)
		cout << "整";
	if (a == 0)
		cout << "整";
	daxie(int(100 * b) % 10, ((i != 0 || int(10 * b) % 10 != 0) && int(1000 * b) % 10));
	if (int(100 * b) % 10 != 0 && int(1000 * b) % 10 == 0)
		cout << "角整";
	else if (int(100 * b) % 10 != 0 && int(1000 * b) % 10 != 0)
		cout << "角";
	daxie(int(1000 * b) % 10, 0);
	if (int(1000 * b) % 10 != 0)
		cout << "分";

	cout << endl;
	return 0;
}