/*王浩 信07 2152041*/
#include <iostream>
using namespace std;

int main()
{
	int a;
	cout << "请输入一个[0..99999]间的整数\n";
	cin >> a;
	if (a / 10000 % 10 == 0 && a / 1000 % 10 == 0 && a / 100 % 10 == 0 && a / 10 % 10 == 0)
	{
		cout << "一位数\n";
		cout << "每位数字分别是 ： \n";
		cout << a << endl;
		cout << "逆序输出的每位数字分别是 : \n";
		cout << a << endl;
	}
	else if (a / 10000 % 10 == 0 && a / 1000 % 10 == 0 && a / 100 % 10 == 0 && a / 10 % 10 != 0)
	{
		cout << "两位数\n";
		cout << "每位数字分别是 ： \n";
		cout << a / 10 % 10 << " " << a % 10 << endl;
		cout << "逆序输出的每位数字分别是 : \n";
		cout << a % 10 << " " << a / 10 % 10<< endl;
	}
	else if (a / 10000 % 10 == 0 && a / 1000 % 10 == 0 && a / 100 % 10 != 0)
	{
		cout << "三位数\n";
		cout << "每位数字分别是 ： \n";
		cout << a / 100 % 10 << " " << a / 10 % 10 << " " << a % 10 << endl;
		cout << "逆序输出的每位数字分别是 : \n";
		cout << a % 10 << " " << a / 10 % 10 << " " << a / 100 % 10 << endl;
	}
	else if (a / 10000 % 10 == 0 && a / 1000 % 10 != 0)
	{
		cout << "四位数\n";
		cout << "每位数字分别是 ： \n";
		cout << a / 1000 % 10 << " " << a / 100 % 10 << " " << a / 10 % 10 << " " << a % 10 << endl;
		cout << "逆序输出的每位数字分别是 : \n";
		cout << a % 10 << " " << a / 10 % 10 << " " << a / 100 % 10 << " " << a / 1000 % 10 <<  endl;
	}
	else
	{
		cout << "五位数\n";
		cout << "每位数字分别是 ： \n";
		cout << a / 10000 % 10<<" " << a / 1000 % 10 << " " << a / 100 % 10 << " " << a / 10 % 10 << " " << a % 10 << endl;
		cout << "逆序输出的每位数字分别是 : \n";
		cout << a % 10 << " " << a / 10 % 10 << " " << a / 100 % 10 << " " << a / 1000 % 10 << " " << a / 10000 % 10 << endl;
	}
	return 0;
}