/*王浩 信07 2152041*/
#include <iostream>
#include <iomanip>
using namespace std;

/***************************************************************************
  函数名称：squar
  功    能：求平方根的函数
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
double squar(int a)
{
	double  b, x;
	if (a == 1)
		return 1;
	else
	{
		b = (double)(a / 2);
		while (1)
		{
			x = (b + a / b) / 2;
			if (((x - b) < 0.00001 && x > b) || ((b - x) < 0.00001) && b > x)
				break;
			b = x;
		}
		return x;
	}
}


/***************************************************************************
  函数名称：
  功    能：重复输入，直到取得int型正整数后返回
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
***************************************************************************/
int input()
{
	int x;
	while (1) {
		cout << "请输入a值\n";
		cin >> x;
		if (cin.fail())
		{
			cin.clear();
			cin.ignore(65536, '\n');
			continue;
		}
		if (x > 0)
			break;
	}
	return x;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int main()
{
	int a = input();

	/* 此处调用求平方根的函数，函数名、形参、返回值自行设计，函数内不要有任何输出语句 */
	squar(a);

	/* 此处输出平方根（语句不全，将后面补齐，最后要输出换行符）*/
	cout << a << "的平方根=" << setiosflags(ios::fixed) << setprecision(3) << squar(a) << endl;

	return 0;
}
