/*王浩 信07 2152041*/
#include <iostream>
using namespace std;

int main()
{
		int a, b, c;
		bool leap=true;//定义一个bool型变量，便于是否执行语句的判断
		cout << "请输入年，月，日" << endl;
		cin >> a >> b >> c;
		if ((a % 4 == 0&&a%100!=0)||a%400==0)                    //先判断是否是闰年，以年月日的顺序来进行分支
		{
			if (b > 12 || b < 1)
			{
				cout << "输入错误-月份不正确\n";
				leap = false;
			}
			else
			{
				if (b == 1 || b == 3 || b == 5 || b == 7 || b == 8 || b == 10 || b == 12)
				{
					if (c > 31 || c < 1)
					{
						cout << "输入错误-日与月的关系非法\n";
						leap = false;
					}
				}
				else if (b == 2)
				{
					if (c > 29 || c < 10)
					{
						cout << "输入错误-日与月的关系非法\n";
						leap = false;
					}
				}
				else
				{
					if (c > 30 || c < 1)
					{
						cout << "输入错误-日与月的关系非法\n";
						leap = false;
					}
				}
				if (leap)
				{
					if (b == 1)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c << "天\n";
					if (b == 2)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 31 << "天\n";
					if (b == 3)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 60 << "天\n";
					if (b == 4)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 91 << "天\n";
					if (b == 5)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 121 << "天\n";
					if (b == 6)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 152 << "天\n";
					if (b == 7)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 182 << "天\n";
					if (b == 8)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 213 << "天\n";
					if (b == 9)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 244 << "天\n";
					if (b == 10)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 274 << "天\n";
					if (b == 11)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 305 << "天\n";
					if (b == 12)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 335 << "天\n";
				}
			}
		}
		else
		{
			if (b > 12 || b < 1)
			{
				cout << "输入错误-月份不正确\n";
				leap = false;
			}
			else
			{
				if (b == 1 || b == 3 || b == 5 || b == 7 || b == 8 || b == 10 || b == 12)
				{
					if (c > 31 || c < 1)
					{
						cout << "输入错误-日与月的关系非法\n";
						leap = false;
					}
		        }
				else if (b == 2)
				{
					if (c > 28 || c < 10)
					{
						cout << "输入错误-日与月的关系非法\n";
						leap = false;
					}
				}
				else
				{
					if (c > 30 || c < 1)
					{
						cout << "输入错误-日与月的关系非法\n";
						leap = false;
					}
				}
				if (leap)
				{
					if (b == 1)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c << "天\n";
					if (b == 2)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 31 << "天\n";
					if (b == 3)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 59 << "天\n";
					if (b == 4)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 90 << "天\n";
					if (b == 5)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 120 << "天\n";
					if (b == 6)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 151 << "天\n";
					if (b == 7)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 181 << "天\n";
					if (b == 8)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 212 << "天\n";
					if (b == 9)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 243 << "天\n";
					if (b == 10)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 273 << "天\n";
					if (b == 11)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 304 << "天\n";
					if (b == 12)
						cout << a << "-" << b << "-" << c << "是" << a << "年的第" << c + 334 << "天"<<endl;
				}
			}
		}
		return 0;
	}
